# 1. Tuple არის უცვლადი ხოლო List ცვლადია 
#    Tuple-ის შექმნის შემდეგ მისი შიგთავსი შეცვლას ვერ შევძლებთ ხოლო List-ის ელემენტების დამატება წაშლა და რედაქტირება შესაძლებელია

# 2. Tuple-ს აქვს უფრო მაღალი მუშაობის სიჩქარე ვიდრე List-ს
#   რადგან მისი სტრუქტურა უფრო მარტივია და მასზე ოპერაციები უფრო სწრაფად სრულდება

# 3. Tuple-ს გამოიყენებენ მაშინ, როცა მონაცემები უცვლელია, ხოლო List-ს მაშინ როცა საჭიროა მონაცემთა ცვლილება





# week_days = ("ორშაბათი", "სამშაბათი", "ოთხშაბათი", "ხუთშაბათი", "პარასკევი", "შაბათი", "კვირა")

# mon, tue, wed, thu, fri, sat, sun = week_days

# print(mon)
# print(tue)
# print(wed)
# print(thu)
# print(fri)
# print(sat)
# print(sun)





# fruits = ("ვაშლი", "ფორთოხალი", "ბანანი", "ატამი")

# item = "ბანანი"

# if item in fruits:
#     print(f"{item} არის tuple-ში.")
# else:
#     print(f"{item} არ არის tuple-ში.")
