# დუბლიკატები:

# list შეიძლება შეიცავდეს დუბლიკატებს
# set არ ინახავს დუბლიკატებს  თითოეული მნიშვნელობა უნიკალურია




# ინდექსაცია და წვდომა:

# list-ში ელემენტებზე წვდომა შესაძლებელია ინდექსის გამოყენებით
# set-ში ინდექსაცია არ არის მხარდაჭერილი




# ოპერაციები:

# set მხარს უჭერს მათემატიკურ ოპერაციებს
# list არ აქვს ასეთი ოპერაციები პირდაპირ




# my_set = {1, 2, 3, 4, 5}

# print("საწყისი set:", my_set)

# try:
#     my_set[0] = 100
# except TypeError as e:
#     print("შეცდომა:", e)




# fast_food = {"ბურგერი", "პიცა", "ფრი", "ჰოთ-დოგი"}

# print("Fast food პროდუქტები:", fast_food)

# fast_food.clear()

# fast_food.update({"ავოკადო", "ბროკოლი", "ქინოა", "თევზი"})

# print("ჯანსაღი პროდუქტები:", fast_food)
