# set1 = {"ვაშლი", "მსხალი", "ბანანი", "ატამი"}
# set2 = {"ბანანი", "ატამი", "ყურძენი", "ფორთოხალი"}

# print("პირველი set:", set1)
# print("მეორე set:", set2)

# union_set = set1 | set2
# print("გაერთიანება:", union_set)

# intersection_set = set1 & set2
# print("მსგავსებები (გადაკვეთა):", intersection_set)

# difference_set = set1 - set2
# print("განსხვავება (set1 - set2):", difference_set)

# symmetric_difference_set = set1 ^ set2
# print("ორმხრივი განსხვავება:", symmetric_difference_set)





# my_dict = {
#     "სახელი": "ლუკა",
#     "ასაკი": 14,
#     "ქალაქი": "თბილისი",
#     "პროფესია": "unemployed dude"
# }

# for value in my_dict.values():
#     print("მნიშვნელობა:", value)






# დიქშენერი:

# დიქშენერი არის გაუმჭვირვალე მონაცემთა კონტეინერი, სადაც შენახულია key-value წყვილები
# ყველა წყვილი მოიცავს უნიკალურ გასაღებს რომელსაც ასოცირებული აქვს მნიშვნელობა


# სეტები:

# სეტები არიან დაუდგენელი და უნიკალური მონაცემთა კოლექციები
# ისინი საშუალებას აძლევენ სწრაფად გამოიცნოთ თუ კონკრეტული ელემენტი უკვე არის ან არა კოლექციაში