# count = 0

# while count < 20:
#     print("hello world!")
#     count += 1













# user_input = input("შეიყვანეთ ელემენთები გამოყავით ისისნი მძიმეთი: ")

# items = user_input.split(',')

# for item in items:
#     print(item.strip())











# set	dictionary	tuple

# ყველა არის მონაცემთა სტრუქტურები Python-ში	

# ყველა შეიძლება გამოყენებულ იქნას for ციკლში		

# ყველა შეიძლება შეიქმნას ცარიელი ან კონკრეტული ელემენტებით








# Mutable:
# ეს ნიშნავს, რომ ობიექტის შეიძლება შეცვლა მისი შექმნის შემდეგ.

# შეგიძლია დაამატო, წაშალო ან შეცვალო ელემენტი ობიექტში.


# Immutable:
# ეს ნიშნავს, რომ ობიექტს ვერ შეცვლი მის შექმნამდე.

# თუ გინდა ცვლილება — უნდა შექმნა ახალი ობიექტი.






# კონკატენაცია:

# კონკატენაცია ნიშნავს ორ ან მეტ სტრინგის ერთმანეთზე გადაბმას ერთ დიდ სტრინგად.